{
    "Apple": {
        "2025-05-15": [
            {
                "title": "‘No more India’: Trump pressures Apple to shift iPhone production back to US",
                "description": "Trump added that India has one of the world’s highest tariff barriers but has recently offered to drop tariffs on US goods to improve trade ties.",
                "publishedAt": "2025-05-15T08:16:32Z",
                "source": "Bloomberg"
            },
            {
                "title": "Trump asks Apple to stop moving iPhone production to India",
                "description": "Donald Trump asked Apple Inc.’s CEO to stop building plants in India to make devices for the U.S., pushing  domestic production. Read on",
                "publishedAt": "2025-05-15T13:18:19Z",
                "source": "Financial Post"
            },
            {
                "title": "IPhone Supplier TDK Readies Batteries Geared for Thin AI Gadgets",
                "description": "TDK Corp. is readying a new generation of batteries to power smartphones through AI tasks at a time that major client Apple Inc. is also preparing to launch a slimmer handset.",
                "publishedAt": "2025-05-15T20:17:51Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-13": [
            {
                "title": "Study finds BILT for Apple Vision Pro accelerates training",
                "description": "Immersive technologies increase learning speed, accuracy and confidence GRAPEVINE, Texas, May 13, 2025 (GLOBE NEWSWIRE) — BILT Incorporated, creators of 3D Intelligent Instructions®, confirms findings of a case study that evaluated the impact of spatial compu…",
                "publishedAt": "2025-05-13T11:04:52Z",
                "source": "Financial Post"
            },
            {
                "title": "Google Unveils Major Android Redesign Ahead of iPhone Overhaul",
                "description": "Google unveiled the biggest update to its Android mobile operating system in years, weeks before its biggest competitor in the space, Apple Inc., is expected to give a preview of its overhauled iPhone software.",
                "publishedAt": "2025-05-13T17:17:05Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-12": [
            {
                "title": "Apple Plans AI-Powered Battery Management Mode for Devices in iOS 19",
                "description": "Apple Inc. is planning to use artificial intelligence technology to address a frequent source of customer frustration: the iPhone’s battery life.",
                "publishedAt": "2025-05-12T18:46:57Z",
                "source": "Financial Post"
            },
            {
                "title": "Apple plans AI-powered battery management mode for devices in iOS 19",
                "description": "Apple Inc. is planning to use AI tech to address a frequent source of customer frustration: the iPhone’s battery life. Find out more here",
                "publishedAt": "2025-05-12T18:46:57Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Apple Is Developing Specialized Chips for Glasses, New Macs and AI Servers",
                "description": "Apple Inc.’s silicon design group is working on new chips that will serve as the brains for future devices, including its first smart glasses, more powerful Macs and artificial intelligence servers.",
                "publishedAt": "2025-05-08T17:07:48Z",
                "source": "Financial Post"
            },
            {
                "title": "From Apple to GM, Tariffs to Cost Companies Tens of Billions",
                "description": "From Apple Inc. to General Motors Co., corporate America is bracing for tens of billions of dollars in damages from Trump’s trade war — and that’s before most affected goods have landed.",
                "publishedAt": "2025-05-08T13:13:41Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-16": [
            {
                "title": "Fortnite says its now offline on Apple’s iOS around the world",
                "description": "NEW YORK (AP) — Fortnite says it’s now unavailable on Apple’s iOS globally because the tech giant blocked a bid to release the popular video game for iPhone users in the U.S. and Europe. “Apple has blocked our Fortnite submission so we cannot release to the U…",
                "publishedAt": "2025-05-16T15:59:45Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "CRTC kicks off CanCon hearing as big streamers cancel appearances",
                "description": "OTTAWA — The CRTC launched a hearing about drafting a new definition for Canadian content Wednesday, but three big American streaming companies dropped off the schedule at the last minute. Netflix, Paramount and Apple cancelled their individual appearances, w…",
                "publishedAt": "2025-05-14T19:56:16Z",
                "source": "Financial Post"
            }
        ]
    },
    "Microsoft": {
        "2025-05-13": [
            {
                "title": "SecurityBridge Teams up With Microsoft to Enhance SAP Security With Microsoft Sentinel",
                "description": "INGOLSTADT, Germany — SecurityBridge, the Cybersecurity Command Center for SAP, is pleased to announce its collaboration with Microsoft to integrate SAP data into Microsoft Sentinel. The integration enables SecurityBridge to seamlessly share SAP security even…",
                "publishedAt": "2025-05-13T07:25:14Z",
                "source": "Financial Post"
            },
            {
                "title": "Microsoft to lay off about 3% of its workforce",
                "description": "Microsoft says it is laying off nearly 3% of its entire workforce. The tech giant didn’t disclose the total amount of lost jobs but it will amount to about 6,000 people. Microsoft employed 228,000 full-time workers as of last June, the last time it reported i…",
                "publishedAt": "2025-05-13T16:00:23Z",
                "source": "Financial Post"
            },
            {
                "title": "Microsoft among software stocks offering haven in tariff chaos",
                "description": "As the Trump trade war clouds the economic outlook, software has dramatically outperformed this year relative to the rest of tech. Read on.",
                "publishedAt": "2025-05-13T14:33:18Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-12": [
            {
                "title": "Procurify Welcomes Microsoft’s Zia Mansoor to Board for AI Strategy Acceleration and Product Innovation",
                "description": "Renowned Microsoft executive joins Procurify to help shape the future of mid-market spend management through AI-driven innovation and product strategy VANCOUVER, British Columbia — Procurify, the AI-powered spend management platform for the mid-market, today …",
                "publishedAt": "2025-05-12T13:08:23Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-15": [
            {
                "title": "Vena Sets New Standard in Agentic AI for FP&A With Microsoft Teams Integration",
                "description": "Vena Copilot for Microsoft Teams is a first-of-its-kind integration that supercharges strategic planning, collaboration and decision making with AI agents to multiply FP&A expertise across the business TORONTO — Vena, the only Complete FP&A platform powered b…",
                "publishedAt": "2025-05-15T10:10:04Z",
                "source": "Financial Post"
            },
            {
                "title": "Microsoft Signs Major Carbon-Removal Deal With Montag’s Rubicon",
                "description": "Microsoft Corp. has agreed to finance the extraction of 18 million tons of carbon dioxide from the atmosphere, in what’s set to be one of the largest-ever purchases of carbon removal credits.",
                "publishedAt": "2025-05-15T11:40:37Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Enhance office productivity with savings on Microsoft Office",
                "description": "There's no better time to save on Microsoft Office and its top-rated assortment of productivity apps.",
                "publishedAt": "2025-05-08T17:00:02Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "Microsoft Is cutting thousands of employees across the company, including at LinkedIn",
                "description": "Microsoft Corp. said it will cut 6,000 workers across the company in an effort to reduce management layers. Read more",
                "publishedAt": "2025-05-14T11:44:03Z",
                "source": "Financial Post"
            }
        ]
    },
    "Amazon": {
        "2025-05-15": [
            {
                "title": "With rising costs, many turn to Amazon for financial flexibility",
                "description": "This Amazon FBA course bundle lets you explore e-commerce as a flexible, affordable side income in today’s challenging economy.",
                "publishedAt": "2025-05-15T12:00:34Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-16": [
            {
                "title": "Amazon, worker union before Quebec labour tribunal over warehouse closures",
                "description": "MONTREAL — A Quebec labour tribunal has begun hearing a case against Amazon over the e-commerce giant’s closure in January of seven warehouses in the province. Some 1,700 employees lost their jobs following Amazon’s sudden termination of its Quebec warehouse …",
                "publishedAt": "2025-05-16T22:27:24Z",
                "source": "Financial Post"
            },
            {
                "title": "Origins Launches in the U.S. Amazon Premium Beauty Store",
                "description": "The brand brings its high-performance, clinically proven, nature-inspired skincare to Amazon shoppers NEW YORK — Origins, with over 30 years of expertise in combining naturally-derived and scientifically crafted ingredients for powerful skincare, announced it…",
                "publishedAt": "2025-05-16T13:13:17Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-13": [
            {
                "title": "AWS and HUMAIN Announce Groundbreaking AI Zone to Accelerate AI Adoption in Saudi Arabia and Globally",
                "description": "More than $5 billion joint investment in AI infrastructure, AWS services, and AI training and talent development will advance Saudi Arabia’s mission to be a global leader in AI RIYADH, Saudi Arabia — Amazon Web Services, Inc. (AWS), an Amazon.com, Inc. compan…",
                "publishedAt": "2025-05-13T16:20:21Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "Boomi and AWS Announce Strategic Collaboration to Transform Enterprise AI Integration, Automation, and SAP Cloud Migration",
                "description": "CONSHOHOCKEN, Pa. — Boomi™, the leader in AI-driven automation, today announced a multi-year Strategic Collaboration Agreement (SCA) with Amazon Web Services (AWS) to help customers build, manage, monitor and govern generative artificial intelligence (AI) age…",
                "publishedAt": "2025-05-14T13:19:26Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "The construction of a road in Brazil draws criticism before first-ever climate talks in the Amazon",
                "description": "BELEM, Brazil (AP) — In the run-up to the annual U.N. climate conference, set to take place in Brazil’s Amazon in November, the construction of a road is drawing attention, with critics arguing it will lead to environmental degradation. Before the talks, call…",
                "publishedAt": "2025-05-08T13:37:16Z",
                "source": "Financial Post"
            }
        ]
    },
    "Alphabet": {
        "2025-05-14": [
            {
                "title": "Alphabet analyst says ‘complete breakup’ needed for stock gains",
                "description": "The Google parent's companies such as Youtube and Waymo could be 'worth more in pieces than together,' analysts say. Find out more",
                "publishedAt": "2025-05-14T14:06:37Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-09": [
            {
                "title": "Alphabet shares take US$120 billion blow as search warnings blare",
                "description": "Alphabet is on pace for a weekly decline of about six per cent and US$120 billion drop in market value. Find out more.",
                "publishedAt": "2025-05-09T13:29:49Z",
                "source": "Financial Post"
            }
        ]
    },
    "Meta": {
        "2025-05-16": [
            {
                "title": "FTC rests at Meta monopoly trial, shifting focus to defence",
                "description": "The Federal Trade Commission wrapped up its case for breaking up Meta Platforms Inc. as an illegal social-media monopoly. Find out more here",
                "publishedAt": "2025-05-16T17:33:56Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-15": [
            {
                "title": "Abortion-rights groups denounce censorship on Meta-owned apps in Latin America and beyond",
                "description": "MEXICO CITY (AP) — All of a sudden, women contacting one of the biggest sources of information about abortion in Mexico through the encrypted messaging app WhatsApp were met with silence. The nongovernmental organization’s business account had been blocked. W…",
                "publishedAt": "2025-05-15T16:40:55Z",
                "source": "Financial Post"
            }
        ]
    },
    "Tesla": {
        "2025-05-09": [
            {
                "title": "Tesla Supplier Panasonic to Slash 10,000 Jobs in Big Overhaul",
                "description": "Panasonic Holdings Corp. is slashing headcount by 10,000, or more than 4%, part of a push to cull non-growth operations and boost profitability.",
                "publishedAt": "2025-05-09T10:37:20Z",
                "source": "Financial Post"
            }
        ]
    },
    "NVIDIA": {
        "2025-05-14": [
            {
                "title": "Trump to overhaul AI chip curbs reviled by Nvidia and US allies",
                "description": "Trump administration revamps semiconductor export regulations, replacing Biden-era approach, drawing objections from US allies and tech companies.",
                "publishedAt": "2025-05-14T04:39:16Z",
                "source": "Bloomberg"
            }
        ],
        "2025-05-13": [
            {
                "title": "Nvidia to Sell Chips to Saudi AI Firm for Data Center Plan",
                "description": "Nvidia Corp. will send semiconductors to Saudi Arabian artificial intelligence company Humain for a 500-megawatt data center buildout, part of a Trump administration initiative that lifts previous restrictions on shipping advanced AI capabilities to the regio…",
                "publishedAt": "2025-05-13T16:10:52Z",
                "source": "Financial Post"
            },
            {
                "title": "US Weighs Letting UAE Buy Over a Million Advanced Nvidia Chips",
                "description": "The Trump administration is weighing a deal that would allow the United Arab Emirates to import more than a million advanced Nvidia Corp. chips, people familiar with the matter said, a quantity that far exceeds limits under Biden-era AI chip regulations — and…",
                "publishedAt": "2025-05-13T16:00:36Z",
                "source": "Financial Post"
            }
        ]
    },
    "Samsung": {
        "2025-05-13": [
            {
                "title": "Samsung in Talks to Buy FläktGroup in $1.5 Billion-Plus Deal",
                "description": "Samsung Electronics Co. is closing in on an agreement to buy FläktGroup Holding GmbH, acquiring the European heating and cooling specialist in its biggest overseas takeover in eight years.",
                "publishedAt": "2025-05-13T10:24:11Z",
                "source": "Financial Post"
            },
            {
                "title": "Do you want a skinny smartphone with worse battery life?",
                "description": "Samsung's new Galaxy S25 Edge is 5.8 millimeters thick, compared to the S25's 7.2.",
                "publishedAt": "2025-05-13T22:34:07Z",
                "source": "The Washington Post"
            }
        ],
        "2025-05-15": [
            {
                "title": "NEO Battery Appoints Ex-Samsung Large-Scale Cell Expert, Dr. Jun Sik Jeoung, as Senior Scientific Advisor of Commercialization & Cell Development",
                "description": "Appointed Dr. Jun Sik Jeoung as Senior Scientific Advisor of Commercialization & Cell Development Over 17 Years of Experience in Lithium-Ion Battery R&D, Scale-Up, and Production at Global Battery Cell Manufacturers & Automotive OEM At Samsung, Led BMW i3 EV …",
                "publishedAt": "2025-05-15T12:04:14Z",
                "source": "Financial Post"
            }
        ]
    },
    "Tencent": {},
    "Alibaba": {},
    "IBM": {},
    "Intel": {
        "2025-05-13": [
            {
                "title": "Intel Certifies Shell Lubricant for Cooling AI Data Centers",
                "description": "Intel Corp. has certified Shell Plc’s lubricant-based method for cooling servers more efficiently within data centers used for artificial intelligence.",
                "publishedAt": "2025-05-13T13:32:43Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Apple Is Developing Specialized Chips for Glasses, New Macs and AI Servers",
                "description": "Apple Inc.’s silicon design group is working on new chips that will serve as the brains for future devices, including its first smart glasses, more powerful Macs and artificial intelligence servers.",
                "publishedAt": "2025-05-08T17:07:48Z",
                "source": "Financial Post"
            }
        ]
    },
    "Oracle": {},
    "Sony": {
        "2025-05-14": [
            {
                "title": "Sony’s profits rises on robust performance for music, movies and games",
                "description": "TOKYO (AP) — Japanese technology and entertainment company Sony logged an 18% rise in profit for the fiscal year through March on healthy results at its music and video-game operations. Tokyo-based Sony Corp. said Wednesday that its annual profit totaled 1.14…",
                "publishedAt": "2025-05-14T04:14:34Z",
                "source": "Financial Post"
            }
        ]
    },
    "Adobe": {},
    "Netflix": {
        "2025-05-08": [
            {
                "title": "Netflix investors unfazed by tariffs with growth engine humming",
                "description": "Not even the threat of massive tariffs on films has been enough for investors to question Netflix's prospects. Find out more",
                "publishedAt": "2025-05-08T13:17:43Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "CRTC kicks off CanCon hearing as big streamers cancel appearances",
                "description": "OTTAWA — The CRTC launched a hearing about drafting a new definition for Canadian content Wednesday, but three big American streaming companies dropped off the schedule at the last minute. Netflix, Paramount and Apple cancelled their individual appearances, w…",
                "publishedAt": "2025-05-14T19:56:16Z",
                "source": "Financial Post"
            }
        ]
    },
    "AMD": {
        "2025-05-13": [
            {
                "title": "AMD Unveils EPYC 4005 Series Processors, Delivering Workload-Optimized Solutions for Entry-Level Enterprise",
                "description": "— AMD EPYC 4005 Processors provide a compelling balance of performance, dependability and efficiency in an affordable, easy-to-deploy platform — SANTA CLARA, Calif., May 13, 2025 (GLOBE NEWSWIRE) — AMD (NASDAQ: AMD) today announced the launch of AMD EPYC™ 400…",
                "publishedAt": "2025-05-13T13:00:48Z",
                "source": "Financial Post"
            },
            {
                "title": "Vultr Deploys New AMD EPYC™ 4005 Series Processors to Deliver Easy-to-Use, Low-Cost Systems for Growing Businesses",
                "description": "Vultr delivers performance, dependability and efficiency in an affordable, easy-to-deploy platform with new AMD EPYC offerings WEST PALM BEACH, Fla. — Vultr, the world’s largest privately-held cloud infrastructure company, today announced that it is one of th…",
                "publishedAt": "2025-05-13T14:04:15Z",
                "source": "Financial Post"
            }
        ]
    },
    "Qualcomm": {},
    "Cisco": {},
    "JP Morgan": {},
    "Goldman Sachs": {
        "2025-05-14": [
            {
                "title": "Trump Favors $40-$50 Oil, Goldman Says After Scrutinizing Posts",
                "description": "US President Donald Trump appears to prefer oil prices between $40 and $50 a barrel, according to Goldman Sachs Group Inc., citing an in-house analysis of his social-media posts on the topic.",
                "publishedAt": "2025-05-14T02:37:45Z",
                "source": "Financial Post"
            },
            {
                "title": "Empower to Offer Private Markets Investments to Retirement Plans",
                "description": "Firm aligns with Apollo, Franklin Templeton, Goldman Sachs, Neuberger Berman, PIMCO, Partners Group and Sagard Nation’s second largest retirement plan provider opens private market investing to its 19 million plan participants1 GREENWOOD VILLAGE, Colo. — In a…",
                "publishedAt": "2025-05-14T13:13:02Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-13": [
            {
                "title": "‘Bulldog’ Ex-Goldman Banker Answers Carney’s Call to Fix Canada Resources Sector",
                "description": "The first time Timothy Hodgson was asked by Mark Carney to come to Ottawa, he left behind an investment banking career at Goldman Sachs Group Inc. that had seen him climb the ranks to lead its Canadian business.",
                "publishedAt": "2025-05-13T17:32:30Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "An $80 Billion UAE Firm Is Wooing Trump and Luring Wall Street",
                "description": "Even by Abu Dhabi’s standards, the recent rush of investment bankers is unprecedented. Wall Street giants from Goldman Sachs Group Inc. to Morgan Stanley are courting the hottest new player in town: An $80 billion spinoff from the state oil company that wants…",
                "publishedAt": "2025-05-08T13:03:09Z",
                "source": "Financial Post"
            }
        ]
    },
    "Visa": {
        "2025-05-14": [
            {
                "title": "UK Mulls New Investor Visa Targeting Key Strategic Industries",
                "description": "The UK is drawing up plans for a special visa for foreigners who invest significant sums in Britain, as Prime Minister Keir Starmer’s government seeks to blunt the economic blow from recent tax hikes and wider curbs on work permits.",
                "publishedAt": "2025-05-14T21:04:59Z",
                "source": "Financial Post"
            }
        ]
    },
    "Johnson & Johnson": {},
    "Pfizer": {},
    "ExxonMobil": {},
    "ASML": {},
    "SAP": {
        "2025-05-13": [
            {
                "title": "SecurityBridge Teams up With Microsoft to Enhance SAP Security With Microsoft Sentinel",
                "description": "INGOLSTADT, Germany — SecurityBridge, the Cybersecurity Command Center for SAP, is pleased to announce its collaboration with Microsoft to integrate SAP data into Microsoft Sentinel. The integration enables SecurityBridge to seamlessly share SAP security even…",
                "publishedAt": "2025-05-13T07:25:14Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "smartShift Revolutionizes SAP Modernization with AI-Powered Revert to Standard",
                "description": "Poised to Redefine SAP ERP Modernization, smartShift Unveils AI-Powered Platform to Accelerate Revert to Standard. Boston, MA, May 14, 2025 (GLOBE NEWSWIRE) — smartShift, a global leader in SAP custom code transformation, today announced the development of a …",
                "publishedAt": "2025-05-14T19:59:48Z",
                "source": "Financial Post"
            },
            {
                "title": "Boomi and AWS Announce Strategic Collaboration to Transform Enterprise AI Integration, Automation, and SAP Cloud Migration",
                "description": "CONSHOHOCKEN, Pa. — Boomi™, the leader in AI-driven automation, today announced a multi-year Strategic Collaboration Agreement (SCA) with Amazon Web Services (AWS) to help customers build, manage, monitor and govern generative artificial intelligence (AI) age…",
                "publishedAt": "2025-05-14T13:19:26Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-15": [
            {
                "title": "Saputo Inc.: Fiscal 2025 Fourth Quarter and Year-End Results",
                "description": "MONTREAL, May 15, 2025 (GLOBE NEWSWIRE) — Saputo will release its fiscal 2025 fourth quarter and full-year financial results on Thursday, June 5, 2025. A press release will be issued after markets close, and a conference call is scheduled on Friday, June 6, 2…",
                "publishedAt": "2025-05-15T14:02:19Z",
                "source": "Financial Post"
            }
        ]
    },
    "Siemens": {
        "2025-05-08": [
            {
                "title": "Siemens Energy Projects Limited Impact From Import Tariffs",
                "description": "Siemens Energy AG shrugged off the US tariff chaos that’s hit other German manufacturers, saying that the effect of import duties on its bottom line will be small.",
                "publishedAt": "2025-05-08T05:29:05Z",
                "source": "Financial Post"
            }
        ]
    },
    "Louis Vuitton (LVMH)": {},
    "TotalEnergies": {
        "2025-05-14": [
            {
                "title": "TotalEnergies to Sell 50% Stake in Polish Biogas Unit to HitecVision",
                "description": "TotalEnergies SE agreed to sell a 50% stake in its Polish biogas production business to Norwegian investment firm HitecVision AS as part of the oil major’s strategy to boost return on its renewables investments.",
                "publishedAt": "2025-05-14T09:55:42Z",
                "source": "Financial Post"
            }
        ]
    },
    "Shell": {
        "2025-05-12": [
            {
                "title": "Publication of Prospectus",
                "description": "Shell International Finance B.V. and Shell plc 12 May 2025 Publication of Prospectus The following prospectus has been approved by the UK Financial Conduct Authority and is available for viewing: Information Memorandum dated 9 May 2025 relating to the Multi-C…",
                "publishedAt": "2025-05-12T07:00:18Z",
                "source": "Financial Post"
            },
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 12 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 12 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue…",
                "publishedAt": "2025-05-12T16:40:00Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-15": [
            {
                "title": "SHELL PLC – REPORT ON PAYMENTS TO GOVERNMENTS FOR THE YEAR 2024",
                "description": "Shell plc – Report on Payments to Governments for the year 2024 Basis for preparation – Report on Payments to Governments for the year 2024This Report provides a consolidated overview of the payments to governments made by Shell plc and its subsidiary underta…",
                "publishedAt": "2025-05-15T09:56:29Z",
                "source": "Financial Post"
            },
            {
                "title": "X advertisers from Nestle to Shell deny Musk’s boycott claims",
                "description": "Advertisers say they didn’t coordinate an ad boycott of Elon Musk’s X following his purchase of the social media platform. Find out more",
                "publishedAt": "2025-05-15T20:49:53Z",
                "source": "Financial Post"
            },
            {
                "title": "Shell Paid Nigeria More Tax Than Any Other Country In 2024",
                "description": "Shell Plc paid $5.34 billion in taxes and other charges to Nigeria in 2024, more than any other country.",
                "publishedAt": "2025-05-15T14:13:02Z",
                "source": "Financial Post"
            },
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 15 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 15 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue…",
                "publishedAt": "2025-05-15T16:06:44Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "BP-Shell Megadeal Would Create European Rival to Exxon Mobil",
                "description": "If Shell Plc were to acquire BP Plc, it would be among the largest deals in European history, creating for the first time a European oil major that could challenge industry leaders Exxon Mobil Corp. and Chevron Corp.",
                "publishedAt": "2025-05-08T10:04:40Z",
                "source": "Financial Post"
            },
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 8 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 8 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue: …",
                "publishedAt": "2025-05-08T16:10:06Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-13": [
            {
                "title": "Intel Certifies Shell Lubricant for Cooling AI Data Centers",
                "description": "Intel Corp. has certified Shell Plc’s lubricant-based method for cooling servers more efficiently within data centers used for artificial intelligence.",
                "publishedAt": "2025-05-13T13:32:43Z",
                "source": "Financial Post"
            },
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 13 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 13 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue…",
                "publishedAt": "2025-05-13T16:03:45Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-09": [
            {
                "title": "Shell’s LNG Canada plans first exports as soon as June",
                "description": "Shell Plc’s liquefied natural gas project in Canada is preparing to begin overseas sales as soon as late June. Read more.",
                "publishedAt": "2025-05-09T12:32:35Z",
                "source": "Financial Post"
            },
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 9 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 9 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue: …",
                "publishedAt": "2025-05-09T16:19:17Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-14": [
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 14 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 14 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue…",
                "publishedAt": "2025-05-14T15:57:49Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-16": [
            {
                "title": "Transaction in Own Shares",
                "description": "Transaction in Own Shares 16 May, 2025 • • • • • • • • • • • • • • • • Shell plc (the ‘Company’) announces that on 16 May, 2025 it purchased the following number of Shares for cancellation. Aggregated information on Shares purchased according to trading venue…",
                "publishedAt": "2025-05-16T15:55:07Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-11": [
            {
                "title": "Five Key Charts to Watch in Global Commodity Markets This Week",
                "description": "If Shell Plc and BP Plc tie the knot, the merger would create for the first time a European oil major that could challenge US industry leaders. The data center boom is giving a boost to nuclear energy, but the demand for water that comes with it is raising co…",
                "publishedAt": "2025-05-11T21:38:28Z",
                "source": "Financial Post"
            }
        ]
    },
    "Baidu": {
        "2025-05-16": [
            {
                "title": "Baidu, Bilibili, Lenovo Report as US-China Trade Tensions Ease",
                "description": "Baidu Inc., Bilibili Inc. and Lenovo Group Ltd. are among the Chinese tech firms in focus for next week’s earnings, just as the easing US-China trade war brings back some optimism for the sector.",
                "publishedAt": "2025-05-16T02:10:24Z",
                "source": "Financial Post"
            }
        ]
    },
    "JD.com": {},
    "BYD": {},
    "ICBC": {},
    "Toyota": {
        "2025-05-08": [
            {
                "title": "Toyota reports booming sales but stays cautious on profit because of various costs",
                "description": "TOKYO (AP) — Japan’s top automaker Toyota reported record sales for the fiscal year through March on Thursday, but its profit for the latest quarter faltered partly because of a certification scandal. Toyota Motor Corp.’s January-March net profit totaled 664.…",
                "publishedAt": "2025-05-08T06:42:22Z",
                "source": "Financial Post"
            },
            {
                "title": "Toyota Warns of Profit Drop as Tariff Chaos Threatens Carmakers",
                "description": "Toyota Motor Corp. is bracing itself for a bumpy year, with the Japanese carmaker warning of a slump in profit as global manufacturers scramble to shield themselves from US President Donald Trump’s tariff turmoil.",
                "publishedAt": "2025-05-08T05:39:20Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-11": [
            {
                "title": "Toyota Faces Biggest Hit From Trump Tariffs Among Auto Companies",
                "description": "Toyota Motor Corp. is the biggest carmaker in the world — and also the auto industry’s biggest loser when it comes to projected losses from US President Donald Trump’s trade war.",
                "publishedAt": "2025-05-11T20:32:30Z",
                "source": "Financial Post"
            }
        ]
    },
    "SoftBank": {
        "2025-05-13": [
            {
                "title": "SoftBank profit doubles on AI boost to chip sales, startup value",
                "description": "SoftBank Group Corp's quarterly profit soars 124% on AI demand, boosting startup valuations and chip unit sales.",
                "publishedAt": "2025-05-13T08:53:34Z",
                "source": "Bloomberg"
            }
        ]
    },
    "Nintendo": {
        "2025-05-09": [
            {
                "title": "Full Immersion with Voice Acting & Bonus Story! Mystery Adventure Game ‘Staffer Case’ Available on Nintendo Switch Pre-orders",
                "description": "SEOUL, South Korea — Shinsegae I&C Inc. (KRX: 035510) announced that the digital version of mystery adventure game Staffer Case is officially launching for Nintendo Switch globally on Thursday, May 29. “Set in a fictional version of 1960s London, Staffer Case…",
                "publishedAt": "2025-05-09T13:09:34Z",
                "source": "Financial Post"
            }
        ]
    },
    "Hyundai": {},
    "Reliance Industries": {},
    "Tata Consultancy Services": {}
}