{
    "Apple": {
        "2025-05-07": [
            {
                "title": "Harvest Announces Filing of the Preliminary Prospectus for Harvest Apple Enhanced High Income Shares ETF",
                "description": "OAKVILLE, Ontario — Harvest Portfolios Group Inc. (“Harvest”) is pleased to announce that it has filed a preliminary prospectus with the Canadian securities regulators for the Harvest Apple Enhanced High Income Shares ETF (“APLE”). APLE provides single-stock …",
                "publishedAt": "2025-05-07T19:42:36Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-02": [
            {
                "title": "Apple hit with pair of downgrades as tariff worries grow",
                "description": "Apple received at least two downgrades on Friday, following quarterly results that reinforced concerns over tariffs. Read more.",
                "publishedAt": "2025-05-02T14:40:57Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Apple Is Developing Specialized Chips for Glasses, New Macs and AI Servers",
                "description": "Apple Inc.’s silicon design group is working on new chips that will serve as the brains for future devices, including its first smart glasses, more powerful Macs and artificial intelligence servers.",
                "publishedAt": "2025-05-08T17:07:48Z",
                "source": "Financial Post"
            },
            {
                "title": "From Apple to GM, Tariffs to Cost Companies Tens of Billions",
                "description": "From Apple Inc. to General Motors Co., corporate America is bracing for tens of billions of dollars in damages from Trump’s trade war — and that’s before most affected goods have landed.",
                "publishedAt": "2025-05-08T13:13:41Z",
                "source": "Financial Post"
            }
        ]
    },
    "Microsoft": {
        "2025-05-08": [
            {
                "title": "Enhance office productivity with savings on Microsoft Office",
                "description": "There's no better time to save on Microsoft Office and its top-rated assortment of productivity apps.",
                "publishedAt": "2025-05-08T17:00:02Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-06": [
            {
                "title": "One Tech Tip: Skype shut down for good, but users still have these alternatives",
                "description": "LONDON (AP) — Skype is dead. What now? Microsoft’s shutdown of Skype on May 5 sent millions of users scrambling to find an alternative to the pioneering internet phone service. Skype, which Microsoft bought in 2011, was beloved by a dwindling group of users w…",
                "publishedAt": "2025-05-06T15:10:47Z",
                "source": "Financial Post"
            }
        ]
    },
    "Amazon": {
        "2025-05-07": [
            {
                "title": "Amazon to Invest More Than $4 Billion to Launch Infrastructure Region in Chile",
                "description": "New AWS South America (Chile) Region will enable customers to run workloads and securely store their content in Chile while serving end users with even lower latency Active customers in Chile include AgroSuper, Andres Bello University, Banco de Chile, Banco I…",
                "publishedAt": "2025-05-07T13:13:29Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "The construction of a road in Brazil draws criticism before first-ever climate talks in the Amazon",
                "description": "BELEM, Brazil (AP) — In the run-up to the annual U.N. climate conference, set to take place in Brazil’s Amazon in November, the construction of a road is drawing attention, with critics arguing it will lead to environmental degradation. Before the talks, call…",
                "publishedAt": "2025-05-08T13:37:16Z",
                "source": "Financial Post"
            }
        ]
    },
    "Alphabet": {
        "2025-05-02": [
            {
                "title": "U.S. to demand Google break up its online advertising business",
                "description": "The DoJ is asking a judge to force Google parent Alphabet to sell its ad exchange and publisher server tech after a trial victory. Read more",
                "publishedAt": "2025-05-02T20:35:06Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-09": [
            {
                "title": "Alphabet shares take US$120 billion blow as search warnings blare",
                "description": "Alphabet is on pace for a weekly decline of about six per cent and US$120 billion drop in market value. Find out more.",
                "publishedAt": "2025-05-09T13:29:49Z",
                "source": "Financial Post"
            }
        ]
    },
    "Meta": {},
    "Tesla": {
        "2025-05-07": [
            {
                "title": "Tesla’s China Sales Drop Again as Rival BYD Posts Gains",
                "description": "Tesla Inc.’s China-made shipments declined for a seventh consecutive month, exacerbating a slump in the electric vehicle maker’s global sales.",
                "publishedAt": "2025-05-07T09:52:44Z",
                "source": "Financial Post"
            },
            {
                "title": "Musk’s xAI to Use Tesla Batteries at Memphis Supercomputer",
                "description": "Elon Musk’s xAI is using Tesla Inc.’s Megapack batteries to shore up its “Colossus” supercomputer in Memphis, another example of the overlapping interests between Musk’s companies.",
                "publishedAt": "2025-05-07T21:25:24Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-09": [
            {
                "title": "Tesla Supplier Panasonic to Slash 10,000 Jobs in Big Overhaul",
                "description": "Panasonic Holdings Corp. is slashing headcount by 10,000, or more than 4%, part of a push to cull non-growth operations and boost profitability.",
                "publishedAt": "2025-05-09T10:37:20Z",
                "source": "Financial Post"
            }
        ]
    },
    "NVIDIA": {},
    "Samsung": {},
    "Tencent": {},
    "Alibaba": {},
    "IBM": {},
    "Intel": {
        "2025-05-06": [
            {
                "title": "NetApp and Intel Partner to Redefine AI for Enterprises",
                "description": "Groundbreaking solution simplifies AI inferencing for specialized and local applications SAN JOSE, Calif. — NetApp® (NASDAQ: NTAP), the intelligent data infrastructure company, today announced the release of NetApp AIPod Mini with Intel, a joint solution desi…",
                "publishedAt": "2025-05-06T12:10:34Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Apple Is Developing Specialized Chips for Glasses, New Macs and AI Servers",
                "description": "Apple Inc.’s silicon design group is working on new chips that will serve as the brains for future devices, including its first smart glasses, more powerful Macs and artificial intelligence servers.",
                "publishedAt": "2025-05-08T17:07:48Z",
                "source": "Financial Post"
            }
        ]
    },
    "Oracle": {
        "2025-05-05": [
            {
                "title": "What Warren Buffett’s Exit as CEO Means for Berkshire Hathaway",
                "description": "On today’s Big Take podcast: How the “Oracle of Omaha” changed investing and what comes next for the company Buffett built. ​​​​​",
                "publishedAt": "2025-05-05T23:18:53Z",
                "source": "Financial Post"
            }
        ]
    },
    "Sony": {},
    "Adobe": {},
    "Netflix": {
        "2025-05-05": [
            {
                "title": "Netflix, Disney shares slip on tariffs plan for foreign films",
                "description": "Shares in U.S. entertainment companies fell after Donald Trump announced 100 per cent tariffs on films produced overseas. Find out more",
                "publishedAt": "2025-05-05T01:54:30Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-08": [
            {
                "title": "Netflix investors unfazed by tariffs with growth engine humming",
                "description": "Not even the threat of massive tariffs on films has been enough for investors to question Netflix's prospects. Find out more",
                "publishedAt": "2025-05-08T13:17:43Z",
                "source": "Financial Post"
            }
        ]
    },
    "AMD": {
        "2025-05-07": [
            {
                "title": "AMD to Host Annual Meeting of Stockholders",
                "description": "SANTA CLARA, Calif., May 07, 2025 (GLOBE NEWSWIRE) — AMD (NASDAQ: AMD) will hold its Annual Meeting of Stockholders on Wednesday, May 14, 2025 at 9 a.m. PDT as a virtual meeting accessible at Forward-looking and other material information may be discussed dur…",
                "publishedAt": "2025-05-07T20:30:33Z",
                "source": "Financial Post"
            }
        ],
        "2025-05-02": [
            {
                "title": "Chengdu Origen and Vanotech Announce First Patient Dosed in VAN-2401 Phase 1 Trial of Gene Therapy for Wet Age-Related Macular Degeneration",
                "description": "Clinical trial of KH658 evaluates single suprachoroidal space administration of gene-therapy treatment for wet AMD CHENGDU, China and ROCKAWAY, N.J., May 02, 2025 (GLOBE NEWSWIRE) — Chengdu Origen Biotechnology Co., Ltd. (“Chengdu Origen”) and Vanotech Ltd. (…",
                "publishedAt": "2025-05-02T08:59:06Z",
                "source": "Financial Post"
            }
        ]
    },
    "Qualcomm": {},
    "Cisco": {},
    "JP Morgan": {},
    "Goldman Sachs": {},
    "Visa": {},
    "Johnson & Johnson": {},
    "Pfizer": {},
    "ExxonMobil": {},
    "ASML": {},
    "SAP": {},
    "Siemens": {},
    "Louis Vuitton (LVMH)": {},
    "TotalEnergies": {},
    "Shell": {},
    "Baidu": {},
    "JD.com": {},
    "BYD": {},
    "ICBC": {},
    "Toyota": {},
    "SoftBank": {},
    "Nintendo": {},
    "Hyundai": {},
    "Reliance Industries": {},
    "Tata Consultancy Services": {}
}